app/views/users/all_users.html.erb

SELECT "users".* FROM "users"
---
<p>Organization: <%= @organization.inspect %>
<p>This method has called `Users.unscoped.all` so that they will be returned regardless of the subdomain / scope.</p>