app/controllers/application_controller.rb

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."subdomain" = ? LIMIT ?  [["subdomain", "pirates"], ["LIMIT", 1]]
---
    def current_organization
      Organization.find_by_subdomain(request.subdomain)