app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @request = request
    @organization = current_organization

    user = User.find(params[:id])

SELECT "users".* FROM "users"
---
  def all_users
    @request = request
    @organization = current_organization
    @users = User.unscoped.all